In [16]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

raw_data = {'first_name' : ['Jason', np.nan, 'Tina', "jake", 'Amy'],
           'last_name' : ['Miller', 'Jacobson', np.nan, 'Milner', 'Cooze'],
            'age' : [42, np.nan, 36, 24, 24],
            'city' : ['San Francisco', 'Baltimoer', 'Miami', np.nan, 'Boston']}
df = DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name   age           city
0      Jason    Miller  42.0  San Francisco
1        NaN  Jacobson   NaN      Baltimoer
2       Tina       NaN  36.0          Miami
3       jake    Milner  24.0            NaN
4        Amy     Cooze  24.0         Boston

In [14]:
modeS = df.city.mode()
modeS[0]

'Baltimoer'

In [3]:
df.isnull()

   first_name  last_name    age   city
0       False      False  False  False
1        True      False   True  False
2       False       True  False  False
3       False      False  False   True
4       False      False   True  False

In [4]:
df.isnull().sum()

first_name    1
last_name     1
age           2
city          1
dtype: int64

In [10]:
df["age"].fillna(df["age"].mean()) #mean = 34

0    42.0
1    34.0
2    36.0
3    24.0
4    34.0
Name: age, dtype: float64

In [16]:
df["age"].fillna(df["age"].median(), inplace=True) #median = 36

In [26]:
df.fillna(0)

  first_name last_name   age           city
0      Jason    Miller  42.0  San Francisco
1          0  Jacobson   0.0      Baltimoer
2       Tina         0  36.0          Miami
3       jake    Milner  24.0              0
4        Amy     Cooze  24.0         Boston

In [27]:
df.replace(
    [0], np.nan, inplace=True
)

In [28]:
df

  first_name last_name   age           city
0      Jason    Miller  42.0  San Francisco
1        NaN  Jacobson   NaN      Baltimoer
2       Tina       NaN  36.0          Miami
3       jake    Milner  24.0            NaN
4        Amy     Cooze  24.0         Boston

In [20]:
df.dropna(thresh=3) #val_num - NaN_num < x 면 삭제됨.

  first_name last_name   age           city
0      Jason    Miller  42.0  San Francisco
2       Tina       NaN  36.0          Miami
3       jake    Milner  24.0            NaN
4        Amy     Cooze  24.0         Boston

In [3]:
x = [1, 2]

In [ ]:
x.map x